brtchip-paul-jiao/stm32L4_Eve_example/FT_Eve_Hal/FT_Gpu_Hal.c
		memset(&devList, 0, sizeof(devList));
#ifdef MSVC_PLATFORM_LIBMPSSE
		SPI_GetChannelInfo(0,&devList);
#endif
#ifdef MSVC_PLATFORM_Lib4222
		/* Alya */
        ftStatus = FT_GetDeviceInfoDetail(0, &devList.Flags, &devList.Type, &devList.ID, &devList.LocId,
                                        devList.SerialNumber,
                                        devList.Description,
                                        &devList.ftHandle);

#endif
		printf("Information on channel number %d:\n",0);
		/* print the dev info */
		printf(" Flags=0x%x\n",devList.Flags);
		printf(" Type=0x%x\n",devList.Type);
		printf(" ID=0x%x\n",devList.ID);
		printf(" LocId=0x%x\n",devList.LocId);
		printf(" SerialNumber=%s\n",devList.SerialNumber);
		printf(" Description=%s\n",devList.Description);
		printf(" ftHandle=0x%x\n",devList.ftHandle);/*is 0 unless open*/
	}
#endif

#ifdef STM32L4_DISCOVERY
	  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	  HAL_Init();
	  /* Configure the system clock */
	  SystemClock_Config();
	  /* Initialize all configured peripherals */
	  MX_GPIO_Init();
	  MX_SPI_Init();
#endif

	return TRUE;
}
ft_bool_t    Ft_Gpu_Hal_Open(Ft_Gpu_Hal_Context_t *host)
{
#ifdef FT900_PLATFORM

	gpio_function(host->hal_config.spi_cs_pin_no, pad_spim_ss0); /* GPIO28 as CS */
	gpio_write(host->hal_config.spi_cs_pin_no, 1);

	gpio_function(host->hal_config.pdn_pin_no, pad_gpio43);
	gpio_dir(host->hal_config.pdn_pin_no, pad_dir_output);

    gpio_write(host->hal_config.pdn_pin_no,1);


#endif
#ifdef MSVC_FT800EMU
	Ft_GpuEmu_SPII2C_begin();
#endif
#ifdef ARDUINO_PLATFORM_SPI
	pinMode(host->hal_config.pdn_pin_no, OUTPUT);
	digitalWrite(host->hal_config.pdn_pin_no, HIGH);
    pinMode(host->hal_config.spi_cs_pin_no, OUTPUT);
    digitalWrite(host->hal_config.spi_cs_pin_no, HIGH);
	SPI.begin();
	SPI.setClockDivider(SPI_CLOCK_DIV2);
	SPI.setBitOrder(MSBFIRST);
	SPI.setDataMode(SPI_MODE0);
#endif
#ifdef MSVC_PLATFORM_SPI
	FT_STATUS status;					
#ifdef MSVC_PLATFORM_LIBMPSSE
    ChannelConfig channelConf;			//channel configuration
		
	/* configure the spi settings */
	channelConf.ClockRate = host->hal_config.spi_clockrate_khz * 1000; 
	channelConf.LatencyTimer= 2;       
	channelConf.configOptions = SPI_CONFIG_OPTION_MODE0 | SPI_CONFIG_OPTION_CS_DBUS3 | SPI_CONFIG_OPTION_CS_ACTIVELOW;
	channelConf.Pin = 0x00000000;	/*FinalVal-FinalDir-InitVal-InitDir (for dir 0=in, 1=out)*/

	/* Open the first available channel */
	status = SPI_OpenChannel(host->hal_config.channel_no,(FT_HANDLE *)&host->hal_handle);
    if (FT_OK != status)
    {
        printf("SPI open channel failed %d %d\n",host->hal_config.channel_no,host->hal_handle);
        return FALSE;
    }
	status = SPI_InitChannel((FT_HANDLE)host->hal_handle,&channelConf);
    if (FT_OK != status)
    {
        printf("SPI init channel failed %d %d\n",host->hal_config.channel_no,host->hal_handle);
        return FALSE;
    }

	printf("\nhandle=0x%x status=0x%x\n",host->hal_handle,status);	
#endif
#ifdef MSVC_PLATFORM_Lib4222
	FT4222_Version Version4222;
	FT4222_ClockRate clock4222;
	GPIO_Dir gpioDir[4] = {GPIO_OUTPUT,GPIO_INPUT,GPIO_OUTPUT,GPIO_OUTPUT};

	status = FT_Open(host->hal_config.channel_no,(FT_HANDLE *)&host->hal_handle);
    if (FT_OK != status)
    {
        printf("4222 open failed %d %d\n",host->hal_config.channel_no,host->hal_handle);
        return FALSE;
    }

    // no latency to usb
    status = FT_SetLatencyTimer(host->hal_handle, 2);
    if (FT_OK != status)
    {
        printf("FT_SetLatencyTimerfailed! %d\n",status);
        return 0;
    }


    status = FT4222_SPIMaster_Init(host->hal_handle, SPI_IO_SINGLE, CLK_DIV_32, CLK_ACTIVE_LOW, CLK_LEADING, 1);
    if (FT_OK != status)
    {
        printf("Init FT4222 as SPI master device failed! %d\n",status);
        return FALSE;
    }

    status = FT4222_SPI_SetDrivingStrength(host->hal_handle,DS_4MA, DS_4MA, DS_4MA);
    if (FT4222_OK != status)
    {
        printf("FT4222_SPI_SetDrivingStrength failed!\n");
        return 0;
    }
	FT4222_GetVersion(host->hal_handle, &Version4222);
	FT4222_SetClock(host->hal_handle, SYS_CLK_80);
	FT4222_GetClock(host->hal_handle, &clock4222);

	printf("\nhandle=0x%x status=0x%x version %d setclock %d\n",host->hal_handle,status,Version4222,clock4222);	
	/* Init GPIO for 4222 */
	status = FT4222_GPIO_Init(host->hal_handle, gpioDir);
	FT4222_GPIO_Write((FT_HANDLE)host->hal_handle,GPIO_PORT0,1);

#endif
#endif

	/* Initialize the context valriables */
	host->ft_cmd_fifo_wp = host->ft_dl_buff_wp = 0;
	host->spinumdummy = 1;//by default ft800/801/810/811 goes with single dummy byte for read
	host->spichannel = 0;
	host->status = FT_GPU_HAL_OPENED;

#ifdef STM32L4_DISCOVERY
	host->hal_handle = &hspi1;
#endif

	return TRUE;
}
ft_void_t  Ft_Gpu_Hal_Close(Ft_Gpu_Hal_Context_t *host)
{
	host->status = FT_GPU_HAL_CLOSED;
#ifdef MSVC_PLATFORM_SPI	

#ifdef MSVC_PLATFORM_LIBMPSSE
	/* Close the channel*/
	SPI_CloseChannel(host->hal_handle);
#endif

#ifdef MSVC_PLATFORM_Lib4222
	FT4222_UnInitialize(host->hal_handle);
	FT_Close(host->hal_handle);
#endif
	
#endif
#ifdef ARDUINO_PLATFORM_SPI
        SPI.end();
#endif
#ifdef MSVC_FT800EMU
	Ft_GpuEmu_SPII2C_end();
#endif

#ifdef FT900_PLATFORM
	//spi_close(SPIM,0);
#endif

#ifdef STM32L4_DISCOVERY
    host->hal_handle = NULL;
#endif
}

ft_void_t Ft_Gpu_Hal_DeInit()
{
#ifdef MSVC_PLATFORM_SPI

#ifdef MSVC_PLATFORM_LIBMPSSE
   //Cleanup the MPSSE Lib
   Cleanup_libMPSSE();
#endif

#ifdef MSVC_PLATFORM_Lib4222
	
#endif

#endif
#ifdef FT900_PLATFORM
   spi_uninit(SPIM);
#endif

#ifdef STM32L4_DISCOVERY
    MX_SPI_DeInit();
#endif
}

/*The APIs for reading/writing transfer continuously only with small buffer system*/
ft_void_t  Ft_Gpu_Hal_StartTransfer(Ft_Gpu_Hal_Context_t *host,FT_GPU_TRANSFERDIR_T rw,ft_uint32_t addr)
{
	if (FT_GPU_READ == rw){

#ifdef FT900_PLATFORM
		ft_uint8_t spidata[4];
		spidata[0] = (addr >> 16);
		spidata[1] = (addr >> 8);
		spidata[2] =  addr &0xff;
		spi_open(SPIM, host->hal_config.spi_cs_pin_no);


		spi_writen(SPIM,spidata,3);
#endif

#ifdef MSVC_PLATFORM_SPI

		ft_uint8_t Transfer_Array[4];
		ft_uint32_t SizeTransfered;
		ft_uint16_t SizeTransfered16;

		/* Compose the read packet */
		Transfer_Array[0] = addr >> 16;
		Transfer_Array[1] = addr >> 8;
		Transfer_Array[2] = addr;

		Transfer_Array[3] = 0; //Dummy Read byte
#ifdef MSVC_PLATFORM_LIBMPSSE
		SPI_Write((FT_HANDLE)host->hal_handle,Transfer_Array,sizeof(Transfer_Array),&SizeTransfered,SPI_TRANSFER_OPTIONS_SIZE_IN_BYTES | SPI_TRANSFER_OPTIONS_CHIPSELECT_ENABLE);
#endif
#ifdef MSVC_PLATFORM_Lib4222
		FT4222_GPIO_Write((FT_HANDLE)host->hal_handle,GPIO_PORT2,0);
		FT4222_SPIMaster_SingleWrite((FT_HANDLE)host->hal_handle, Transfer_Array,sizeof(Transfer_Array),&SizeTransfered16,TRUE);
#endif

#endif

#ifdef ARDUINO_PLATFORM_SPI
		digitalWrite(host->hal_config.spi_cs_pin_no, LOW);
		SPI.transfer(addr >> 16);
		SPI.transfer(highByte(addr));
		SPI.transfer(lowByte(addr));

		SPI.transfer(0); //Dummy Read Byte
#endif

#ifdef MSVC_FT800EMU
		Ft_GpuEmu_SPII2C_StartRead(addr);
#endif

#ifdef STM32L4_DISCOVERY
		FT81X_CS_ACTIVE();
		uint8_t spiRdHdr[4];

		/*STM32L4XX is Little Endian, LSB is in lowest address for addr*/
		spiRdHdr[0] = (addr >> 16) & 0x3F; //MSB is sent first
		spiRdHdr[1] = (addr >> 8) & 0xFF;
		spiRdHdr[2] =  addr & 0xFF;
		spiRdHdr[3] = 0; //dummy byte
		HAL_SPI_Transmit(host->hal_handle, spiRdHdr,sizeof(spiRdHdr),HAL_MAX_DELAY);

		/*The first 3 bytes are dummy bytes and discard it*/
		uint8_t rxBuff[3]= {0};
		HAL_SPI_Receive(host->hal_handle, rxBuff,sizeof(rxBuff),HAL_MAX_DELAY);
#endif
		host->status = FT_GPU_HAL_READING;
	}else{
	
#ifdef FT900_PLATFORM
		ft_uint8_t spidata[4];
		spidata[0] = (0x80|(addr >> 16));
		spidata[1] = (addr >> 8);
		spidata[2] = addr;


		spi_open(SPIM, host->hal_config.spi_cs_pin_no);
		spi_writen(SPIM,spidata,3);

#endif
	
#ifdef MSVC_PLATFORM_SPI
		ft_uint8_t Transfer_Array[3];
		ft_uint32_t SizeTransfered;
		ft_uint16_t SizeTransfered16;

		/* Compose the read packet */
		Transfer_Array[0] = (0x80 | (addr >> 16));
		Transfer_Array[1] = addr >> 8;
		Transfer_Array[2] = addr;
#ifdef MSVC_PLATFORM_LIBMPSSE
		SPI_Write((FT_HANDLE)host->hal_handle,Transfer_Array,3,&SizeTransfered,SPI_TRANSFER_OPTIONS_SIZE_IN_BYTES | SPI_TRANSFER_OPTIONS_CHIPSELECT_ENABLE);		
#endif
#ifdef MSVC_PLATFORM_Lib4222
		FT4222_GPIO_Write((FT_HANDLE)host->hal_handle,GPIO_PORT2,0);
		FT4222_SPIMaster_SingleWrite((FT_HANDLE)host->hal_handle, Transfer_Array,sizeof(Transfer_Array),&SizeTransfered16,TRUE);
#endif
#endif
#ifdef ARDUINO_PLATFORM_SPI
		digitalWrite(host->hal_config.spi_cs_pin_no, LOW);
		SPI.transfer(0x80 | (addr >> 16));
		SPI.transfer(highByte(addr));
		SPI.transfer(lowByte(addr));
#endif
#ifdef MSVC_FT800EMU
		Ft_GpuEmu_SPII2C_StartWrite(addr);
#endif

#ifdef STM32L4_DISCOVERY
		FT81X_CS_ACTIVE();
		uint8_t spiWrHdr[3];
		spiWrHdr[0] = 0x80 | ((addr >> 16) & 0x3F);
		spiWrHdr[1] = 0xFF & (addr >> 8);
		spiWrHdr[2] = addr & 0xFF;
		HAL_SPI_Transmit(host->hal_handle, spiWrHdr,sizeof(spiWrHdr),HAL_MAX_DELAY);
#endif
		host->status = FT_GPU_HAL_WRITING;
	}
}



